alphingj/ESPClaw-DevBoard/board/sdkconfig.defaults.board
# ESP32-DevKitC (Classic ESP32) Board Configuration
# 4MB Flash, No PSRAM (classic ESP32 doesn't have integrated PSRAM)
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_40M=y
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_SPIRAM=n
CONFIG_IDF_TARGET="esp32"

# Console via UART0 (connected to CP2102 USB-to-UART)
CONFIG_ESP_CONSOLE_UART=y
CONFIG_ESP_CONSOLE_UART_NUM=0
CONFIG_ESP_CONSOLE_UART_BAUDRATE=115200
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

# Enable LEDC for PWM (needed for LED control)
CONFIG_LEDC_ENABLE=y

# Enable GPIO for button/LED
CONFIG_GPIO_ENABLE=y

# Disable features that require PSRAM or specific newer chips
CONFIG_APP_CLAW_LUA_MODULE_CAMERA=n
CONFIG_APP_CLAW_LUA_MODULE_VISION=n
CONFIG_APP_CLAW_LUA_MODULE_AUDIO=n
CONFIG_ESP_BOARD_DEV_AUDIO_CODEC_SUPPORT=n

# Minimal Lua modules for basic functionality
CONFIG_APP_CLAW_LUA_MODULE_GPIO=y
CONFIG_APP_CLAW_LUA_MODULE_LEDC=y
CONFIG_APP_CLAW_LUA_MODULE_SYSTEM=y
CONFIG_APP_CLAW_LUA_MODULE_DELAY=y
CONFIG_APP_CLAW_LUA_MODULE_JSON=y
CONFIG_APP_CLAW_LUA_MODULE_BUTTON=y
CONFIG_APP_CLAW_LUA_MODULE_STORAGE=y

# Network support
CONFIG_APP_CLAW_LUA_MODULE_HTTP_SERVER=y
CONFIG_APP_CLAW_LUA_MODULE_EVENT_PUBLISHER=y